# Kroenke & Auer Chapter 2
Use this notebook to follow along with the class slides (and textbook).

## The Source Code
In this folder are the source files for the examples in textbook:
- DBP-e14-MySQL-Cape-Codd-Create-Tables.sql uses SQL Data Definition Language to create and structure the tables needed for our data
- DBP-e14-MySQL-Cape-Codd-Insert-Data.sql uses SQL Data Manipulation Language to insert data into the tables. 

Before just moving on, open each file to see what the code looks like. You will see lots of comments at the top explaining the purpose and provenance of each file. Then there are lots and lots of SQL statements. They may look like jibberish for now, but within a couple weeks you will know enough to be able to write these files for yourself! 

## The Live Database
To keep things simple, these source files have already been preloaded into a MySQL database on BA Lab server. The commands the system admin used were:
```
mysqladmin create cape_codd
mysql cape_code <DBP-e14-MySQL-Cape-Codd-Create-Tables.sql
mysql cape_codd <DBP-e14-MySQL-Cape-Codd-Insert-Data.sql
```
The above statements are in bash, a langauge for unix system administration from the command line. Can you figure out what each line does? 

After loading the database, user permissions were then granted separately with the SQL command:
```
GRANT SELECT on cape_codd.* to 'ba510student'@'localhost' IDENTIFIED BY 'ba510';
```

The rest of this Notebook will use SQL to extract data from the database.

## Connect to the Database
Fill in the <connect-string> (below) with a properly crafted connect string with the following parameters:
- method: mysql+pymysql
- user: ba510student
- password: ba510
- host: database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com
- database name: cape_codd

In [6]:
%load_ext sql
%sql mysql+pymysql://ba510student:ba510@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: ba510student@cape_codd'

## Try out the queries in the class slides
Each query should be run in a single cell with `%%sql` magic at the top. You will need to add cells as you go along. Tip: use Markdown cells to annotate your queries so you know what they are about. Alternatively, you could use /* */ comments instead. It's up to you.

In [17]:
%%sql
SELECT *
FROM INVENTORY;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
32 rows affected.

[(100, 100100, 'Std. Scuba Tank, Yellow', 250, 0),
 (200, 100100, 'Std. Scuba Tank, Yellow', 100, 50),
 (300, 100100, 'Std. Scuba Tank, Yellow', 100, 0),
 (400, 100100, 'Std. Scuba Tank, Yellow', 200, 0),
 (100, 100200, 'Std. Scuba Tank, Magenta', 200, 30),
 (200, 100200, 'Std. Scuba Tank, Magenta', 75, 75),
 (300, 100200, 'Std. Scuba Tank, Magenta', 100, 100),
 (400, 100200, 'Std. Scuba Tank, Magenta', 250, 0),
 (100, 101100, 'Dive Mask, Small Clear', 0, 500),
 (200, 101100, 'Dive Mask, Small Clear', 0, 500),
 (300, 101100, 'Dive Mask, Small Clear', 300, 200),
 (400, 101100, 'Dive Mask, Small Clear', 450, 0),
 (100, 101200, 'Dive Mask, Med Clear', 100, 500),
 (200, 101200, 'Dive Mask, Med Clear', 50, 500),
 (300, 101200, 'Dive Mask, Med Clear', 475, 0),
 (400, 101200, 'Dive Mask, Med Clear', 250, 250),
 (100, 201000, 'Half-dome Tent', 2, 100),
 (200, 201000, 'Half-dome Tent', 10, 250),
 (300, 201000, 'Half-dome Tent', 250, 0),
 (400, 201000, 'Half-dome Tent', 0, 250),
 (100, 202000, 'Half-dome Tent Vestibule', 10, 250),
 (200, 202000, 'Half-dome Tent Vestibule', 1, 250),
 (300, 202000, 'Half-dome Tent Vestibule', 100, 0),
 (400, 202000, 'Half-dome Tent Vestibule', 0, 200),
 (100, 301000, 'Light Fly Climbing Harness', 300, 250),
 (200, 301000, 'Light Fly Climbing Harness', 250, 250),
 (300, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 301000, 'Light Fly Climbing Harness', 0, 250),
 (100, 302000, 'Locking Carabiner, Oval', 1000, 0),
 (200, 302000, 'Locking Carabiner, Oval', 1250, 0),
 (300, 302000, 'Locking Carabiner, Oval', 500, 500),
 (400, 302000, 'Locking Carabiner, Oval', 0, 1000)]

In [19]:
%%sql
SELECT SKU , SKU_description , Department , Buyer
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[(100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen'),
 (100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
 (101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
 (201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [20]:
%%sql
SELECT SKU , Department  , Buyer , SKU_description
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[(100100, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Yellow'),
 (100200, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Magenta'),
 (101100, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Small Clear'),
 (101200, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Med Clear'),
 (201000, 'Camping', 'Cindy Lo', 'Half-dome Tent'),
 (202000, 'Camping', 'Cindy Lo', 'Half-dome Tent Vestibule'),
 (301000, 'Climbing', 'Jerry Martin', 'Light Fly Climbing Harness'),
 (302000, 'Climbing', 'Jerry Martin', 'Locking Carabiner, Oval')]

In [21]:
%%sql
/* *** SQL Query-CH01-01 *** */
SELECT SKU , Department  , Buyer , SKU_description
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[(100100, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Yellow'),
 (100200, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Magenta'),
 (101100, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Small Clear'),
 (101200, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Med Clear'),
 (201000, 'Camping', 'Cindy Lo', 'Half-dome Tent'),
 (202000, 'Camping', 'Cindy Lo', 'Half-dome Tent Vestibule'),
 (301000, 'Climbing', 'Jerry Martin', 'Light Fly Climbing Harness'),
 (302000, 'Climbing', 'Jerry Martin', 'Locking Carabiner, Oval')]

In [23]:
%%sql

SELECT *
FROM INVENTORY
WHERE QuantityOnHand <10;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
9 rows affected.

[(100, 101100, 'Dive Mask, Small Clear', 0, 500),
 (200, 101100, 'Dive Mask, Small Clear', 0, 500),
 (100, 201000, 'Half-dome Tent', 2, 100),
 (400, 201000, 'Half-dome Tent', 0, 250),
 (200, 202000, 'Half-dome Tent Vestibule', 1, 250),
 (400, 202000, 'Half-dome Tent Vestibule', 0, 200),
 (300, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 302000, 'Locking Carabiner, Oval', 0, 1000)]

In [26]:
%%sql

SELECT  Department  , Buyer 
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[('Water Sports', 'Pete Hansen'),
 ('Water Sports', 'Pete Hansen'),
 ('Water Sports', 'Nancy Meyers'),
 ('Water Sports', 'Nancy Meyers'),
 ('Camping', 'Cindy Lo'),
 ('Camping', 'Cindy Lo'),
 ('Climbing', 'Jerry Martin'),
 ('Climbing', 'Jerry Martin')]

In [25]:
%%sql

SELECT DISTINCT  Department  , Buyer 
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
4 rows affected.

[('Water Sports', 'Pete Hansen'),
 ('Water Sports', 'Nancy Meyers'),
 ('Camping', 'Cindy Lo'),
 ('Climbing', 'Jerry Martin')]

In [27]:
%%sql
/* *** SQL Query-CH01-01 *** */
SELECT SKU , Department  , Buyer , SKU_description
FROM SKU_DATA
ORDER BY SKU DESC;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[(302000, 'Climbing', 'Jerry Martin', 'Locking Carabiner, Oval'),
 (301000, 'Climbing', 'Jerry Martin', 'Light Fly Climbing Harness'),
 (202000, 'Camping', 'Cindy Lo', 'Half-dome Tent Vestibule'),
 (201000, 'Camping', 'Cindy Lo', 'Half-dome Tent'),
 (101200, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Med Clear'),
 (101100, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Small Clear'),
 (100200, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Magenta'),
 (100100, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Yellow')]

In [28]:
%%sql
/* *** SQL Query-CH01-01 *** */
SELECT SKU , Department  , Buyer , SKU_description
FROM SKU_DATA
ORDER BY SKU,SKU_description ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[(100100, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Yellow'),
 (100200, 'Water Sports', 'Pete Hansen', 'Std. Scuba Tank, Magenta'),
 (101100, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Small Clear'),
 (101200, 'Water Sports', 'Nancy Meyers', 'Dive Mask, Med Clear'),
 (201000, 'Camping', 'Cindy Lo', 'Half-dome Tent'),
 (202000, 'Camping', 'Cindy Lo', 'Half-dome Tent Vestibule'),
 (301000, 'Climbing', 'Jerry Martin', 'Light Fly Climbing Harness'),
 (302000, 'Climbing', 'Jerry Martin', 'Locking Carabiner, Oval')]

In [30]:
%%sql 
SELECT SKU ,  SKU_description
FROM INVENTORY
WHERE SKU_description LIKE '%Tent%';

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
8 rows affected.

[(201000, 'Half-dome Tent'),
 (201000, 'Half-dome Tent'),
 (201000, 'Half-dome Tent'),
 (201000, 'Half-dome Tent'),
 (202000, 'Half-dome Tent Vestibule'),
 (202000, 'Half-dome Tent Vestibule'),
 (202000, 'Half-dome Tent Vestibule'),
 (202000, 'Half-dome Tent Vestibule')]

In [32]:
%%sql 
/* *** كيف تكتب فنكشن *** */
CREATE VIEW SKU_TENTS AS (SELECT SKU ,  SKU_description FROM INVENTORY WHERE SKU_description LIKE '%Tent%';)

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 2")
[SQL: /* *** كيف تكتب فنكشن *** */
CREATE VIEW SKU_TENTS AS (SELECT SKU ,  SKU_description FROM INVENTORY WHERE SKU_description LIKE '%%Tent%%';]
(Background on this error at: http://sqlalche.me/e/f405)

In [38]:
%%sql 
SELECT *
FROM CATALOG_SKU_2014
WHERE DateOnWebsite = '01-Jan-2014';

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
0 rows affected.

[]

In [40]:
%%sql

SELECT *
FROM SKU_DATA
WHERE Buyer IN ('Nancy Meyers' , 'Cindy Lo' , 'Jerry Martin') ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
6 rows affected.

[(101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
 (201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [41]:
%%sql

SELECT *
FROM ORDER_ITEM
WHERE ExtendedPrice BETWEEN 100 AND 200 ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
4 rows affected.

[(2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (3000, 101100, 2, Decimal('50.00'), Decimal('100.00')),
 (2000, 101200, 2, Decimal('50.00'), Decimal('100.00')),
 (1000, 202000, 1, Decimal('130.00'), Decimal('130.00'))]

In [42]:
%%sql

SELECT *
FROM SKU_DATA
WHERE Buyer LIKE 'N%' ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
2 rows affected.

[(101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers')]

In [50]:
%%sql 
SELECT *
FROM CATALOG_SKU_2015
WHERE CatalogPage IS NULL;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
0 rows affected.

[]

In [54]:
%%sql

SELECT *
FROM SKU_DATA
WHERE (SKU >200000 or SKU_Description LIKE '%TENT%' )
AND NOT Department = 'Camping'  ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
2 rows affected.

[(301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [55]:
%%sql

SELECT *
FROM SKU_DATA
WHERE SKU >200000 ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
4 rows affected.

[(201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [57]:
%%sql

SELECT *
FROM SKU_DATA
WHERE SKU >200000 or SKU_Description LIKE '%TENT%'  ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
4 rows affected.

[(201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [58]:
%%sql

SELECT *
FROM SKU_DATA
WHERE (SKU >200000 or SKU_Description LIKE '%TENT%' )
AND NOT Department = 'Camping'  ;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
2 rows affected.

[(301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [60]:
%%sql

SELECT COUNT(SKU)
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
1 rows affected.

[(8,)]

In [68]:
%%sql

SELECT COUNT(SKU) AS CountOfSKUs
FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
1 rows affected.

[(8,)]

In [69]:
%%sql

SELECT (Quantity * Price) AS EP
FROM ORDER_ITEM;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
7 rows affected.

[(Decimal('300.00'),),
 (Decimal('200.00'),),
 (Decimal('100.00'),),
 (Decimal('100.00'),),
 (Decimal('50.00'),),
 (Decimal('300.00'),),
 (Decimal('130.00'),)]

In [72]:
%%sql

SELECT *
FROM ORDER_ITEM
WHERE (Quantity * Price) > 150;

 * mysql+pymysql://ba510student:***@database-01202.c55qjoeogr2p.us-east-2.rds.amazonaws.com/cape_codd
3 rows affected.

[(3000, 100200, 1, Decimal('300.00'), Decimal('300.00')),
 (2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (1000, 201000, 1, Decimal('300.00'), Decimal('300.00'))]